tap "antoniorodr/memo"
tap "steipete/tap"
tap "yakitrak/yakitrak"
brew "cloudflared"
brew "ffmpeg"
brew "gemini-cli"
brew "gh"
brew "go"
brew "mise"
brew "mole"
brew "node@22"
brew "pnpm"
brew "tmux"
brew "uv"
brew "whisper-cpp"
brew "starship"
brew "zoxide"
brew "fzf"
brew "antoniorodr/memo/memo"
brew "steipete/tap/bird"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password"
cask "1password-cli"
cask "antigravity"
cask "brave-browser"
cask "claude"
cask "tailscale-app"
